# Data Exploration

<br>

__Technical Notebook -__  Module 1 Microsoft Project <br />
__Data Scientists -__  Nathan Venos, Max Tingle <br />
__Flatiron School -__ DC Data Science Fellowship

<br>

### Importing Libraries

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

### Reading Provided CSV & TSV Data Files

In [2]:
bom_movie_gross = pd.read_csv('../Data/bom.movie_gross.csv.gz')
imdb_name_basics = pd.read_csv('../Data/imdb.name.basics.csv.gz')
imdb_title_akas = pd.read_csv('../Data/imdb.title.akas.csv.gz')
imdb_title_basics = pd.read_csv('../Data/imdb.title.basics.csv.gz')
imdb_title_crew = pd.read_csv('../Data/imdb.title.crew.csv.gz')
imdb_title_principals = pd.read_csv('../Data/imdb.title.principals.csv.gz')
imdb_title_ratings = pd.read_csv('../Data/imdb.title.ratings.csv.gz')
rt_movie_info = pd.read_csv('../Data/rt.movie_info.tsv.gz', sep='\t')
rt_reviews = pd.read_csv('../Data/rt.reviews.tsv.gz', sep='\t', header=0, encoding = 'unicode_escape')
tmdb_movies = pd.read_csv('../Data/tmdb.movies.csv.gz')
tn_movie_budgets = pd.read_csv('../Data/tn.movie_budgets.csv.gz')

### Exploring: bom_movie_gross

In [3]:
bom_movie_gross.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

In [4]:
bom_movie_gross.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 5 columns):
title             3387 non-null object
studio            3382 non-null object
domestic_gross    3359 non-null float64
foreign_gross     2037 non-null object
year              3387 non-null int64
dtypes: float64(1), int64(1), object(3)
memory usage: 132.4+ KB

In [5]:
bom_movie_gross.groupby('studio')['title'].count()

studio
3D             1
A23            2
A24           49
ADC            2
AF             6
AGF            1
ALP            1
AM             1
AR             2
ATO            4
AZ             1
AaF            1
Abk.           1
Abr.          10
Affirm         2
Alc            5
Amazon         7
Ampl.          5
Anch.         18
Annapurna      6
App.           1
ArcEnt         2
Argo.          1
Arrow          1
Arth.          1
Asp.           1
Aviron         3
B360           1
BBC            3
BG            16
            ...
TVC            1
Trafalgar      1
TriS          23
Trib.         14
Triu           1
Truly          1
U/P            1
UEP            1
UHE            1
UTMW           1
UTV           50
Uni.         147
VE             9
VPD            5
Vari.         11
Vita.          7
Viv.           1
W/Dim.        14
WAMCR          2
WB           140
WB (NL)       45
WGUSA         58
WHE            4
WOW            1
Wein.         77
XL             2
YFG            1
Yash          14
Zee            1
Zeit.         16
Name: title, Length: 257, dtype: int64

### Exploring: imdb_name_basics

In [9]:
imdb_name_basics.head()

,nconst,primary_name,birth_year,death_year,primary_profession,known_for_titles
0,nm0061671,Mary Ellen Bauder,NaN,NaN,"miscellaneous,production_manager,producer","tt0837562,tt2398241,tt0844471,tt0118553"
1,nm0061865,Joseph Bauer,NaN,NaN,"composer,music_department,sound_department","tt0896534,tt6791238,tt0287072,tt1682940"
2,nm0062070,Bruce Baum,NaN,NaN,"miscellaneous,actor,writer","tt1470654,tt0363631,tt0104030,tt0102898"
3,nm0062195,Axel Baumann,NaN,NaN,"camera_department,cinematographer,art_department","tt0114371,tt2004304,tt1618448,tt1224387"
4,nm0062798,Pete Baxter,NaN,NaN,"production_designer,art_department,set_decorator","tt0452644,tt0452692,tt3458030,tt2178256"

In [10]:
imdb_name_basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 606648 entries, 0 to 606647
Data columns (total 6 columns):
nconst                606648 non-null object
primary_name          606648 non-null object
birth_year            82736 non-null float64
death_year            6783 non-null float64
primary_profession    555308 non-null object
known_for_titles      576444 non-null object
dtypes: float64(2), object(4)
memory usage: 27.8+ MB

### Exploring: imdb_title_akas

In [11]:
imdb_title_akas.head()

,title_id,ordering,title,region,language,types,attributes,is_original_title
0,tt0369610,10,Джурасик свят,BG,bg,NaN,NaN,0.0
1,tt0369610,11,Jurashikku warudo,JP,NaN,imdbDisplay,NaN,0.0
2,tt0369610,12,Jurassic World: O Mundo dos Dinossauros,BR,NaN,imdbDisplay,NaN,0.0
3,tt0369610,13,O Mundo dos Dinossauros,BR,NaN,NaN,short title,0.0
4,tt0369610,14,Jurassic World,FR,NaN,imdbDisplay,NaN,0.0

In [12]:
imdb_title_akas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 331703 entries, 0 to 331702
Data columns (total 8 columns):
title_id             331703 non-null object
ordering             331703 non-null int64
title                331703 non-null object
region               278410 non-null object
language             41715 non-null object
types                168447 non-null object
attributes           14925 non-null object
is_original_title    331678 non-null float64
dtypes: float64(1), int64(1), object(6)
memory usage: 20.2+ MB

In [14]:
imdb_title_akas.loc[imdb_title_akas.is_original_title == 1].head()

,title_id,ordering,title,region,language,types,attributes,is_original_title
38,tt0369610,45,Jurassic World,NaN,NaN,original,NaN,1.0
80,tt0401729,7,John Carter,NaN,NaN,original,NaN,1.0
83,tt10010134,1,Versailles Rediscovered - The Sun King's Vanis...,NaN,NaN,original,NaN,1.0
86,tt10027708,1,Miguelito - Canto a Borinquen,NaN,NaN,original,NaN,1.0
90,tt10050722,1,Thing I Don't Get,NaN,NaN,original,NaN,1.0

In [15]:
imdb_title_akas.groupby('region')['title_id'].count()

region
AD         3
AE        92
AF        43
AG         8
AI         1
AL       205
AM       119
AN         5
AO        15
AQ         3
AR      4729
AS         3
AT       956
AU      2774
AW         3
AZ       266
BA       366
BB        11
BD       315
BE      1182
BF        22
BG      3728
BH        19
BI         4
BJ         4
BM         5
BN         3
BO       108
BR      8167
BS        26
       ...
TN        64
TO         1
TR      5052
TT        49
TW       552
TZ        31
UA      2563
UG        48
US     51490
UY      1427
UZ        39
VC         1
VE       486
VI        11
VN      1578
VU         4
WF         1
XAS       48
XEU      630
XKO        4
XKV       25
XNA        1
XSA       26
XWG        2
XWW    18467
XYU        3
YE         7
ZA       615
ZM         2
ZW        10
Name: title_id, Length: 213, dtype: int64

### Exploring: imdb_title_basics

In [16]:
imdb_title_basics.head()

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

In [17]:
imdb_title_basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 6 columns):
tconst             146144 non-null object
primary_title      146144 non-null object
original_title     146123 non-null object
start_year         146144 non-null int64
runtime_minutes    114405 non-null float64
genres             140736 non-null object
dtypes: float64(1), int64(1), object(4)
memory usage: 6.7+ MB

In [18]:
imdb_title_basics.groupby('genres')['tconst'].count()

genres
Action                          2219
Action,Adult,Comedy                2
Action,Adventure                 114
Action,Adventure,Animation       197
Action,Adventure,Biography        34
Action,Adventure,Comedy          332
Action,Adventure,Crime            78
Action,Adventure,Documentary     172
Action,Adventure,Drama           239
Action,Adventure,Family           35
Action,Adventure,Fantasy         142
Action,Adventure,History          18
Action,Adventure,Horror           63
Action,Adventure,Music             3
Action,Adventure,Musical           1
Action,Adventure,Mystery          14
Action,Adventure,Romance          10
Action,Adventure,Sci-Fi          152
Action,Adventure,Sport             3
Action,Adventure,Thriller         73
Action,Adventure,War              10
Action,Adventure,Western          15
Action,Animation                  15
Action,Animation,Biography         1
Action,Animation,Comedy           50
Action,Animation,Crime            10
Action,Animation,Documentary       1
Action,Animation,Drama            38
Action,Animation,Family            4
Action,Animation,Fantasy          29
                                ...
Mystery,War                        2
News                              14
News,Talk-Show                     3
Reality-TV                        50
Reality-TV,Sport                   2
Reality-TV,Talk-Show               2
Romance                         1454
Romance,Sci-Fi                    11
Romance,Sci-Fi,Thriller            9
Romance,Sport                      3
Romance,Thriller                  70
Romance,Thriller,War               1
Romance,War                        5
Romance,Western                    2
Sci-Fi                           712
Sci-Fi,Thriller                  131
Sci-Fi,War                         4
Sci-Fi,Western                     4
Short,Thriller                     1
Sport                            361
Sport,Talk-Show                    1
Sport,Thriller                     1
Talk-Show                         39
Thriller                        3046
Thriller,War                       4
Thriller,War,Western               1
Thriller,Western                   4
War                              131
War,Western                        1
Western                          142
Name: tconst, Length: 1085, dtype: int64

### Exploring: imdb_title_crew

In [19]:
imdb_title_crew.head()

      tconst                      directors              writers
0  tt0285252                      nm0899854            nm0899854
1  tt0438973                            NaN  nm0175726,nm1802864
2  tt0462036                      nm1940585            nm1940585
3  tt0835418                      nm0151540  nm0310087,nm0841532
4  tt0878654  nm0089502,nm2291498,nm2292011            nm0284943

In [20]:
imdb_title_crew.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 3 columns):
tconst       146144 non-null object
directors    140417 non-null object
writers      110261 non-null object
dtypes: object(3)
memory usage: 3.3+ MB

### Exploring: imdb_title_principals

In [21]:
imdb_title_principals.head()

      tconst  ordering     nconst  category       job        characters
0  tt0111414         1  nm0246005     actor       NaN       ["The Man"]
1  tt0111414         2  nm0398271  director       NaN               NaN
2  tt0111414         3  nm3739909  producer  producer               NaN
3  tt0323808        10  nm0059247    editor       NaN               NaN
4  tt0323808         1  nm3579312   actress       NaN  ["Beth Boothby"]

In [22]:
imdb_title_principals.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1028186 entries, 0 to 1028185
Data columns (total 6 columns):
tconst        1028186 non-null object
ordering      1028186 non-null int64
nconst        1028186 non-null object
category      1028186 non-null object
job           177684 non-null object
characters    393360 non-null object
dtypes: int64(1), object(5)
memory usage: 47.1+ MB

In [23]:
imdb_title_principals.groupby("category")['tconst'].count()

category
actor                  256718
actress                146208
archive_footage          3307
archive_sound              16
cinematographer         80091
composer                77063
director               146393
editor                  55512
producer               113724
production_designer      9373
self                    65424
writer                  74357
Name: tconst, dtype: int64

### Exploring: imdb_title_ratings

In [24]:
imdb_title_ratings.head()

       tconst  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21

In [25]:
imdb_title_ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 73856 entries, 0 to 73855
Data columns (total 3 columns):
tconst           73856 non-null object
averagerating    73856 non-null float64
numvotes         73856 non-null int64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.7+ MB

### Exploring: rt_movie_info

In [26]:
rt_movie_info.head()

,id,synopsis,rating,genre,director,writer,theater_date,dvd_date,currency,box_office,runtime,studio
0,1,"This gritty, fast-paced, and innovative police...",R,Action and Adventure|Classics|Drama,William Friedkin,Ernest Tidyman,"Oct 9, 1971","Sep 25, 2001",NaN,NaN,104 minutes,NaN
1,3,"New York City, not-too-distant-future: Eric Pa...",R,Drama|Science Fiction and Fantasy,David Cronenberg,David Cronenberg|Don DeLillo,"Aug 17, 2012","Jan 1, 2013",$,"600,000",108 minutes,Entertainment One
2,5,Illeana Douglas delivers a superb performance ...,R,Drama|Musical and Performing Arts,Allison Anders,Allison Anders,"Sep 13, 1996","Apr 18, 2000",NaN,NaN,116 minutes,NaN
3,6,Michael Douglas runs afoul of a treacherous su...,R,Drama|Mystery and Suspense,Barry Levinson,Paul Attanasio|Michael Crichton,"Dec 9, 1994","Aug 27, 1997",NaN,NaN,128 minutes,NaN
4,7,NaN,NR,Drama|Romance,Rodney Bennett,Giles Cooper,NaN,NaN,NaN,NaN,200 minutes,NaN

In [27]:
rt_movie_info.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1560 entries, 0 to 1559
Data columns (total 12 columns):
id              1560 non-null int64
synopsis        1498 non-null object
rating          1557 non-null object
genre           1552 non-null object
director        1361 non-null object
writer          1111 non-null object
theater_date    1201 non-null object
dvd_date        1201 non-null object
currency        340 non-null object
box_office      340 non-null object
runtime         1530 non-null object
studio          494 non-null object
dtypes: int64(1), object(11)
memory usage: 146.3+ KB

In [29]:
rt_movie_info.groupby('studio')['id'].count()

studio
20th Century Fox                            26
20th Century Fox Distribution                1
20th Century Fox Film Corporat               1
A24                                          1
A24 Films                                    3
A24 and DIRECTV                              1
ADV Films                                    1
ATO Pictures                                 1
After Dark Films/Freestyle Releasing         1
Anchor Bay Entertainment                     1
Apparition Films                             1
Argot Pictures                               1
Arrowstorm Entertainment                     1
Artisan                                      1
Artisan Entertainment                        1
Artistic License Films                       1
Aspiration Media                             1
Australian Film Finance Corporation          1
Aviron Pictures                              1
Big World Pictures                           1
Blue Underground                             3
Broad Green Pictures                         2
Buena Vista                                  1
Buena Vista Distribution                     1
Buena Vista Distribution Compa               3
Buena Vista Internationa                     1
Buena Vista Pictures                         5
Buffalo Films                                1
CBS Films                                    2
Capitol Films                                1
                                            ..
Tribeca Film                                 3
Truly Indie                                  1
Truly Indie/BEV Pictures                     1
Truth Aid                                    1
Twentieth Century Fox                        1
Twentieth Century Fox Home Entertainment     2
USA Films                                    3
United Artists                               1
United Artists Pictures                      1
United Artists Pictures/MGM                  1
Universal                                    1
Universal Pictures                          35
Universal Pictures Distributio               1
Universal Pictures International             1
Universal Studios                            2
Universal Studios Home Video                 1
Vanguard Cinema                              1
Variance Films                               1
Vivendi Entertainment                        1
WARNER BROTHERS PICTURES                     2
WB                                           1
Walt Disney Animation Studios                1
Walt Disney Pictures                         6
Warner Bros.                                 8
Warner Bros. Pictures                       21
Weinstein Co.                                1
Weinstein Company                            1
Westchester Films                            1
Wrekin Hill Entertainment                    1
Zeitgeist Films                              1
Name: id, Length: 200, dtype: int64

### Exploring: rt_reviews

In [30]:
rt_reviews.head()

,id,review,rating,fresh,critic,top_critic,publisher,date
0,3,A distinctly gallows take on contemporary fina...,3/5,fresh,PJ Nabarro,0,Patrick Nabarro,"November 10, 2018"
1,3,It's an allegory in search of a meaning that n...,NaN,rotten,Annalee Newitz,0,io9.com,"May 23, 2018"
2,3,... life lived in a bubble in financial dealin...,NaN,fresh,Sean Axmaker,0,Stream on Demand,"January 4, 2018"
3,3,Continuing along a line introduced in last yea...,NaN,fresh,Daniel Kasman,0,MUBI,"November 16, 2017"
4,3,... a perverse twist on neorealism...,NaN,fresh,NaN,0,Cinema Scope,"October 12, 2017"

In [31]:
rt_reviews.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 54432 entries, 0 to 54431
Data columns (total 8 columns):
id            54432 non-null int64
review        48869 non-null object
rating        40915 non-null object
fresh         54432 non-null object
critic        51710 non-null object
top_critic    54432 non-null int64
publisher     54123 non-null object
date          54432 non-null object
dtypes: int64(2), object(6)
memory usage: 3.3+ MB

In [32]:
rt_reviews.groupby('publisher')['id'].count()

publisher
2UE That Movie Show                  20
3AW                                  42
3BlackChicks Review                  39
48 Hills                              2
4Columns                              2
7M Pictures                          87
812filmreviews                        6
AALBC.com                             8
AARP Movies for Grownups             19
ABC News Radio                        7
ABC Radio (Australia)                33
ABC Radio Brisbane                   39
ABC Tucson                            3
AMCtv.com                             1
AOL Black Voices                      2
AV Club                             212
AXS.com                              12
About Boulder                         1
About.com                           183
AboutFilm.com                        28
Access Hollywood                      3
Adelaide Review                      10
Advocate (Baton Rouge, LA)           57
Afro-American                         1
AfterElton.com                        1
Aggressive Comix                      3
Ain't It Cool Movie Reviews           5
Aisle Seat                          157
Akron Beacon Journal                  8
Alachia Queen                         3
                                   ...
amNewYork                            38
bibloi.com                            1
cinemaobsession.com                   1
culturevulture.net                  114
d+kaz. intelligent movie reviews     30
eCinemaCenter.com                     3
eFilmCritic.com                     673
easternKicks.com                      1
european-films.net                   11
eye WEEKLY                           57
fantastiqueZINE                       1
honeycuttshollywood.com              21
iF Magazine                           3
iNews.co.uk                           6
indieWire                            57
io9.com                              15
jackiekcooper.com                    76
leonardmaltin.com                    40
musicOMH.com                          5
n+1                                  11
outrate.net                           1
rec.arts.movies.reviews             441
sbs.com.au                           38
sbs.is                               38
smh.com.au                            3
thelondonpaper                        5
tonymacklin.net                      26
tonymedley.com                       43
www.kcactive.com                      7
www.susangranger.com                 82
Name: id, Length: 1281, dtype: int64

### Exploring: tmdb_movies

In [33]:
tmdb_movies.head()

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186

In [34]:
tmdb_movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26517 entries, 0 to 26516
Data columns (total 10 columns):
Unnamed: 0           26517 non-null int64
genre_ids            26517 non-null object
id                   26517 non-null int64
original_language    26517 non-null object
original_title       26517 non-null object
popularity           26517 non-null float64
release_date         26517 non-null object
title                26517 non-null object
vote_average         26517 non-null float64
vote_count           26517 non-null int64
dtypes: float64(2), int64(3), object(5)
memory usage: 2.0+ MB

### Exploring: tn_movie_budgets

In [35]:
tn_movie_budgets.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [36]:
tn_movie_budgets.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
id                   5782 non-null int64
release_date         5782 non-null object
movie                5782 non-null object
production_budget    5782 non-null object
domestic_gross       5782 non-null object
worldwide_gross      5782 non-null object
dtypes: int64(1), object(5)
memory usage: 271.1+ KB

In [ ]:
# NATHAN STUFF

In [ ]:
len(bom.studio.unique())

In [ ]:
sum(bom.duplicated())

In [ ]:
sum(tn.duplicated())